app/views/employees/show.html.erb

SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 3]]
---

      <% if @employee.documents.present? %>