app/views/documents/_form.html.erb

SELECT "employees".* FROM "employees"
---
           <%= form.label :employee_id, class: 'mb-2'%>
            <%= form.select :employee_id, options_for_select(Employee.all.map {|employee| [employee.name_with_email ,employee.id]},selected: document.doc_type), {prompt: 'Select employee'}, {class: 'form-select form-select-lg rounded-0'}%>