app/controllers/documents_controller.rb

  def create
   @document = Document.new(document_params)
    @document.errors.full_messages
    if @document.save
---
INSERT INTO "documents" ("name", "doc_type", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "komal devi"], ["doc_type", "....."], ["employee_id", 1], ["created_at", "2023-12-21 09:43:13.414530"], ["updated_at", "2023-12-21 09:43:13.414530"]]