app/controllers/employees_controller.rb

  def create
    @employee.errors.full_messages
    if @employee.save
---
INSERT INTO "employees" ("first_name", "middle_name", "last_name", "personal_email", "city", "state", "country", "pincode", "address_line_1", "address_line_2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
   if @employee.update(employee_params)
---
UPDATE "employees" SET "pincode" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["pincode", "111133"], ["updated_at", "2023-12-20 09:24:41.770293"], ["id", 5]]

  def destroy
    if @employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 5]]